ARMmbed/mbed-os/targets/TARGET_MICROCHIP/TARGET_PIC32CX/device/component/matrix.h
#define MATRIX_WPMR_WPKEY_Msk (0xffffffu << MATRIX_WPMR_WPKEY_Pos) /**< \brief (MATRIX_WPMR) Write Protection Key */
#define MATRIX_WPMR_WPKEY(value) ((MATRIX_WPMR_WPKEY_Msk & ((value) << MATRIX_WPMR_WPKEY_Pos)))
#define   MATRIX_WPMR_WPKEY_PASSWD (0x4D4154u << 8) /**< \brief (MATRIX_WPMR) Writing any other value in this field aborts the write operation of the WPEN and CFGFRZ bits. Always reads as 0. */
/* -------- MATRIX_WPSR : (MATRIX Offset: 0x1E8) Write Protect Status Register -------- */
#define MATRIX_WPSR_WPVS (0x1u << 0) /**< \brief (MATRIX_WPSR) Write Protection Violation Status */
#define MATRIX_WPSR_WPVSRC_Pos 8
#define MATRIX_WPSR_WPVSRC_Msk (0xffffu << MATRIX_WPSR_WPVSRC_Pos) /**< \brief (MATRIX_WPSR) Write Protection Violation Source */
/* -------- MATRIX_PSR[16] : (MATRIX Offset: 0x200) Protection Slave 0 Register -------- */
#define MATRIX_PSR_LAUSERH0 (0x1u << 0) /**< \brief (MATRIX_PSR[16]) Low Area USER in HSELx Protected Region */
#define MATRIX_PSR_LAUSERH1 (0x1u << 1) /**< \brief (MATRIX_PSR[16]) Low Area USER in HSELx Protected Region */
#define MATRIX_PSR_LAUSERH2 (0x1u << 2) /**< \brief (MATRIX_PSR[16]) Low Area USER in HSELx Protected Region */
#define MATRIX_PSR_LAUSERH3 (0x1u << 3) /**< \brief (MATRIX_PSR[16]) Low Area USER in HSELx Protected Region */
#define MATRIX_PSR_LAUSERH4 (0x1u << 4) /**< \brief (MATRIX_PSR[16]) Low Area USER in HSELx Protected Region */
#define MATRIX_PSR_LAUSERH5 (0x1u << 5) /**< \brief (MATRIX_PSR[16]) Low Area USER in HSELx Protected Region */
#define MATRIX_PSR_LAUSERH6 (0x1u << 6) /**< \brief (MATRIX_PSR[16]) Low Area USER in HSELx Protected Region */
#define MATRIX_PSR_LAUSERH7 (0x1u << 7) /**< \brief (MATRIX_PSR[16]) Low Area USER in HSELx Protected Region */
#define MATRIX_PSR_RDUSERH0 (0x1u << 8) /**< \brief (MATRIX_PSR[16]) Read USER for HSELx Protected Region */
#define MATRIX_PSR_RDUSERH1 (0x1u << 9) /**< \brief (MATRIX_PSR[16]) Read USER for HSELx Protected Region */
#define MATRIX_PSR_RDUSERH2 (0x1u << 10) /**< \brief (MATRIX_PSR[16]) Read USER for HSELx Protected Region */
#define MATRIX_PSR_RDUSERH3 (0x1u << 11) /**< \brief (MATRIX_PSR[16]) Read USER for HSELx Protected Region */
#define MATRIX_PSR_RDUSERH4 (0x1u << 12) /**< \brief (MATRIX_PSR[16]) Read USER for HSELx Protected Region */
#define MATRIX_PSR_RDUSERH5 (0x1u << 13) /**< \brief (MATRIX_PSR[16]) Read USER for HSELx Protected Region */
#define MATRIX_PSR_RDUSERH6 (0x1u << 14) /**< \brief (MATRIX_PSR[16]) Read USER for HSELx Protected Region */
#define MATRIX_PSR_RDUSERH7 (0x1u << 15) /**< \brief (MATRIX_PSR[16]) Read USER for HSELx Protected Region */
#define MATRIX_PSR_WRUSERH0 (0x1u << 16) /**< \brief (MATRIX_PSR[16]) Write USER for HSELx Protected Region */
#define MATRIX_PSR_WRUSERH1 (0x1u << 17) /**< \brief (MATRIX_PSR[16]) Write USER for HSELx Protected Region */
#define MATRIX_PSR_WRUSERH2 (0x1u << 18) /**< \brief (MATRIX_PSR[16]) Write USER for HSELx Protected Region */
#define MATRIX_PSR_WRUSERH3 (0x1u << 19) /**< \brief (MATRIX_PSR[16]) Write USER for HSELx Protected Region */
#define MATRIX_PSR_WRUSERH4 (0x1u << 20) /**< \brief (MATRIX_PSR[16]) Write USER for HSELx Protected Region */
#define MATRIX_PSR_WRUSERH5 (0x1u << 21) /**< \brief (MATRIX_PSR[16]) Write USER for HSELx Protected Region */
#define MATRIX_PSR_WRUSERH6 (0x1u << 22) /**< \brief (MATRIX_PSR[16]) Write USER for HSELx Protected Region */
#define MATRIX_PSR_WRUSERH7 (0x1u << 23) /**< \brief (MATRIX_PSR[16]) Write USER for HSELx Protected Region */
#define MATRIX_PSR_DPSOA0 (0x1u << 24) /**< \brief (MATRIX_PSR[16]) Downward Protection Split Address for HSELx Protected Region */
#define MATRIX_PSR_DPSOA1 (0x1u << 25) /**< \brief (MATRIX_PSR[16]) Downward Protection Split Address for HSELx Protected Region */
#define MATRIX_PSR_DPSOA2 (0x1u << 26) /**< \brief (MATRIX_PSR[16]) Downward Protection Split Address for HSELx Protected Region */
#define MATRIX_PSR_DPSOA3 (0x1u << 27) /**< \brief (MATRIX_PSR[16]) Downward Protection Split Address for HSELx Protected Region */
#define MATRIX_PSR_DPSOA4 (0x1u << 28) /**< \brief (MATRIX_PSR[16]) Downward Protection Split Address for HSELx Protected Region */
#define MATRIX_PSR_DPSOA5 (0x1u << 29) /**< \brief (MATRIX_PSR[16]) Downward Protection Split Address for HSELx Protected Region */
#define MATRIX_PSR_DPSOA6 (0x1u << 30) /**< \brief (MATRIX_PSR[16]) Downward Protection Split Address for HSELx Protected Region */
#define MATRIX_PSR_DPSOA7 (0x1u << 31) /**< \brief (MATRIX_PSR[16]) Downward Protection Split Address for HSELx Protected Region */
/* -------- MATRIX_PASSR[16] : (MATRIX Offset: 0x240) Protected Areas Split Slave 0 Register -------- */
#define MATRIX_PASSR_PASPLIT0_Pos 0
#define MATRIX_PASSR_PASPLIT0_Msk (0xfu << MATRIX_PASSR_PASPLIT0_Pos) /**< \brief (MATRIX_PASSR[16]) Protected Areas Split for HSELx Protected Region */
#define MATRIX_PASSR_PASPLIT0(value) ((MATRIX_PASSR_PASPLIT0_Msk & ((value) << MATRIX_PASSR_PASPLIT0_Pos)))
#define MATRIX_PASSR_PASPLIT1_Pos 4
#define MATRIX_PASSR_PASPLIT1_Msk (0xfu << MATRIX_PASSR_PASPLIT1_Pos) /**< \brief (MATRIX_PASSR[16]) Protected Areas Split for HSELx Protected Region */
#define MATRIX_PASSR_PASPLIT1(value) ((MATRIX_PASSR_PASPLIT1_Msk & ((value) << MATRIX_PASSR_PASPLIT1_Pos)))
#define MATRIX_PASSR_PASPLIT2_Pos 8
#define MATRIX_PASSR_PASPLIT2_Msk (0xfu << MATRIX_PASSR_PASPLIT2_Pos) /**< \brief (MATRIX_PASSR[16]) Protected Areas Split for HSELx Protected Region */
#define MATRIX_PASSR_PASPLIT2(value) ((MATRIX_PASSR_PASPLIT2_Msk & ((value) << MATRIX_PASSR_PASPLIT2_Pos)))
#define MATRIX_PASSR_PASPLIT3_Pos 12
#define MATRIX_PASSR_PASPLIT3_Msk (0xfu << MATRIX_PASSR_PASPLIT3_Pos) /**< \brief (MATRIX_PASSR[16]) Protected Areas Split for HSELx Protected Region */
#define MATRIX_PASSR_PASPLIT3(value) ((MATRIX_PASSR_PASPLIT3_Msk & ((value) << MATRIX_PASSR_PASPLIT3_Pos)))
#define MATRIX_PASSR_PASPLIT4_Pos 16
#define MATRIX_PASSR_PASPLIT4_Msk (0xfu << MATRIX_PASSR_PASPLIT4_Pos) /**< \brief (MATRIX_PASSR[16]) Protected Areas Split for HSELx Protected Region */
#define MATRIX_PASSR_PASPLIT4(value) ((MATRIX_PASSR_PASPLIT4_Msk & ((value) << MATRIX_PASSR_PASPLIT4_Pos)))
#define MATRIX_PASSR_PASPLIT5_Pos 20
#define MATRIX_PASSR_PASPLIT5_Msk (0xfu << MATRIX_PASSR_PASPLIT5_Pos) /**< \brief (MATRIX_PASSR[16]) Protected Areas Split for HSELx Protected Region */
#define MATRIX_PASSR_PASPLIT5(value) ((MATRIX_PASSR_PASPLIT5_Msk & ((value) << MATRIX_PASSR_PASPLIT5_Pos)))
#define MATRIX_PASSR_PASPLIT6_Pos 24
#define MATRIX_PASSR_PASPLIT6_Msk (0xfu << MATRIX_PASSR_PASPLIT6_Pos) /**< \brief (MATRIX_PASSR[16]) Protected Areas Split for HSELx Protected Region */
#define MATRIX_PASSR_PASPLIT6(value) ((MATRIX_PASSR_PASPLIT6_Msk & ((value) << MATRIX_PASSR_PASPLIT6_Pos)))
#define MATRIX_PASSR_PASPLIT7_Pos 28
#define MATRIX_PASSR_PASPLIT7_Msk (0xfu << MATRIX_PASSR_PASPLIT7_Pos) /**< \brief (MATRIX_PASSR[16]) Protected Areas Split for HSELx Protected Region */
#define MATRIX_PASSR_PASPLIT7(value) ((MATRIX_PASSR_PASPLIT7_Msk & ((value) << MATRIX_PASSR_PASPLIT7_Pos)))
/* -------- MATRIX_PRTSR[16] : (MATRIX Offset: 0x280) Protected Region Top Slave 0 Register -------- */
#define MATRIX_PRTSR_PRTOP0_Pos 0
#define MATRIX_PRTSR_PRTOP0_Msk (0xfu << MATRIX_PRTSR_PRTOP0_Pos) /**< \brief (MATRIX_PRTSR[16]) HSELx Protected Region Top */
#define MATRIX_PRTSR_PRTOP0(value) ((MATRIX_PRTSR_PRTOP0_Msk & ((value) << MATRIX_PRTSR_PRTOP0_Pos)))
#define MATRIX_PRTSR_PRTOP1_Pos 4
#define MATRIX_PRTSR_PRTOP1_Msk (0xfu << MATRIX_PRTSR_PRTOP1_Pos) /**< \brief (MATRIX_PRTSR[16]) HSELx Protected Region Top */
#define MATRIX_PRTSR_PRTOP1(value) ((MATRIX_PRTSR_PRTOP1_Msk & ((value) << MATRIX_PRTSR_PRTOP1_Pos)))
#define MATRIX_PRTSR_PRTOP2_Pos 8
#define MATRIX_PRTSR_PRTOP2_Msk (0xfu << MATRIX_PRTSR_PRTOP2_Pos) /**< \brief (MATRIX_PRTSR[16]) HSELx Protected Region Top */
#define MATRIX_PRTSR_PRTOP2(value) ((MATRIX_PRTSR_PRTOP2_Msk & ((value) << MATRIX_PRTSR_PRTOP2_Pos)))
#define MATRIX_PRTSR_PRTOP3_Pos 12
#define MATRIX_PRTSR_PRTOP3_Msk (0xfu << MATRIX_PRTSR_PRTOP3_Pos) /**< \brief (MATRIX_PRTSR[16]) HSELx Protected Region Top */
#define MATRIX_PRTSR_PRTOP3(value) ((MATRIX_PRTSR_PRTOP3_Msk & ((value) << MATRIX_PRTSR_PRTOP3_Pos)))
#define MATRIX_PRTSR_PRTOP4_Pos 16
#define MATRIX_PRTSR_PRTOP4_Msk (0xfu << MATRIX_PRTSR_PRTOP4_Pos) /**< \brief (MATRIX_PRTSR[16]) HSELx Protected Region Top */
#define MATRIX_PRTSR_PRTOP4(value) ((MATRIX_PRTSR_PRTOP4_Msk & ((value) << MATRIX_PRTSR_PRTOP4_Pos)))
#define MATRIX_PRTSR_PRTOP5_Pos 20
#define MATRIX_PRTSR_PRTOP5_Msk (0xfu << MATRIX_PRTSR_PRTOP5_Pos) /**< \brief (MATRIX_PRTSR[16]) HSELx Protected Region Top */
#define MATRIX_PRTSR_PRTOP5(value) ((MATRIX_PRTSR_PRTOP5_Msk & ((value) << MATRIX_PRTSR_PRTOP5_Pos)))
#define MATRIX_PRTSR_PRTOP6_Pos 24
#define MATRIX_PRTSR_PRTOP6_Msk (0xfu << MATRIX_PRTSR_PRTOP6_Pos) /**< \brief (MATRIX_PRTSR[16]) HSELx Protected Region Top */
#define MATRIX_PRTSR_PRTOP6(value) ((MATRIX_PRTSR_PRTOP6_Msk & ((value) << MATRIX_PRTSR_PRTOP6_Pos)))
#define MATRIX_PRTSR_PRTOP7_Pos 28
#define MATRIX_PRTSR_PRTOP7_Msk (0xfu << MATRIX_PRTSR_PRTOP7_Pos) /**< \brief (MATRIX_PRTSR[16]) HSELx Protected Region Top */
#define MATRIX_PRTSR_PRTOP7(value) ((MATRIX_PRTSR_PRTOP7_Msk & ((value) << MATRIX_PRTSR_PRTOP7_Pos)))
/* -------- MATRIX_PPSELR[3] : (MATRIX Offset: 0x2C0) Protected Peripheral Select 1 Register -------- */
#define MATRIX_PPSELR_USERP0 (0x1u << 0) /**< \brief (MATRIX_PPSELR[3]) User PSELy Peripheral */
#define MATRIX_PPSELR_USERP1 (0x1u << 1) /**< \brief (MATRIX_PPSELR[3]) User PSELy Peripheral */
#define MATRIX_PPSELR_USERP2 (0x1u << 2) /**< \brief (MATRIX_PPSELR[3]) User PSELy Peripheral */
#define MATRIX_PPSELR_USERP3 (0x1u << 3) /**< \brief (MATRIX_PPSELR[3]) User PSELy Peripheral */
#define MATRIX_PPSELR_USERP4 (0x1u << 4) /**< \brief (MATRIX_PPSELR[3]) User PSELy Peripheral */
#define MATRIX_PPSELR_USERP5 (0x1u << 5) /**< \brief (MATRIX_PPSELR[3]) User PSELy Peripheral */
#define MATRIX_PPSELR_USERP6 (0x1u << 6) /**< \brief (MATRIX_PPSELR[3]) User PSELy Peripheral */
#define MATRIX_PPSELR_USERP7 (0x1u << 7) /**< \brief (MATRIX_PPSELR[3]) User PSELy Peripheral */
#define MATRIX_PPSELR_USERP8 (0x1u << 8) /**< \brief (MATRIX_PPSELR[3]) User PSELy Peripheral */
#define MATRIX_PPSELR_USERP9 (0x1u << 9) /**< \brief (MATRIX_PPSELR[3]) User PSELy Peripheral */
#define MATRIX_PPSELR_USERP10 (0x1u << 10) /**< \brief (MATRIX_PPSELR[3]) User PSELy Peripheral */
#define MATRIX_PPSELR_USERP11 (0x1u << 11) /**< \brief (MATRIX_PPSELR[3]) User PSELy Peripheral */
#define MATRIX_PPSELR_USERP12 (0x1u << 12) /**< \brief (MATRIX_PPSELR[3]) User PSELy Peripheral */
#define MATRIX_PPSELR_USERP13 (0x1u << 13) /**< \brief (MATRIX_PPSELR[3]) User PSELy Peripheral */
#define MATRIX_PPSELR_USERP14 (0x1u << 14) /**< \brief (MATRIX_PPSELR[3]) User PSELy Peripheral */
#define MATRIX_PPSELR_USERP15 (0x1u << 15) /**< \brief (MATRIX_PPSELR[3]) User PSELy Peripheral */
#define MATRIX_PPSELR_USERP16 (0x1u << 16) /**< \brief (MATRIX_PPSELR[3]) User PSELy Peripheral */
#define MATRIX_PPSELR_USERP17 (0x1u << 17) /**< \brief (MATRIX_PPSELR[3]) User PSELy Peripheral */
#define MATRIX_PPSELR_USERP18 (0x1u << 18) /**< \brief (MATRIX_PPSELR[3]) User PSELy Peripheral */
#define MATRIX_PPSELR_USERP19 (0x1u << 19) /**< \brief (MATRIX_PPSELR[3]) User PSELy Peripheral */
#define MATRIX_PPSELR_USERP20 (0x1u << 20) /**< \brief (MATRIX_PPSELR[3]) User PSELy Peripheral */
#define MATRIX_PPSELR_USERP21 (0x1u << 21) /**< \brief (MATRIX_PPSELR[3]) User PSELy Peripheral */
#define MATRIX_PPSELR_USERP22 (0x1u << 22) /**< \brief (MATRIX_PPSELR[3]) User PSELy Peripheral */
#define MATRIX_PPSELR_USERP23 (0x1u << 23) /**< \brief (MATRIX_PPSELR[3]) User PSELy Peripheral */
#define MATRIX_PPSELR_USERP24 (0x1u << 24) /**< \brief (MATRIX_PPSELR[3]) User PSELy Peripheral */
#define MATRIX_PPSELR_USERP25 (0x1u << 25) /**< \brief (MATRIX_PPSELR[3]) User PSELy Peripheral */
#define MATRIX_PPSELR_USERP26 (0x1u << 26) /**< \brief (MATRIX_PPSELR[3]) User PSELy Peripheral */
#define MATRIX_PPSELR_USERP27 (0x1u << 27) /**< \brief (MATRIX_PPSELR[3]) User PSELy Peripheral */
#define MATRIX_PPSELR_USERP28 (0x1u << 28) /**< \brief (MATRIX_PPSELR[3]) User PSELy Peripheral */
#define MATRIX_PPSELR_USERP29 (0x1u << 29) /**< \brief (MATRIX_PPSELR[3]) User PSELy Peripheral */
#define MATRIX_PPSELR_USERP30 (0x1u << 30) /**< \brief (MATRIX_PPSELR[3]) User PSELy Peripheral */
#define MATRIX_PPSELR_USERP31 (0x1u << 31) /**< \brief (MATRIX_PPSELR[3]) User PSELy Peripheral */

/*@}*/


#endif /* _PIC32CX_MATRIX_COMPONENT_ */
